package com.yh.jiran;

/**
 * @author: 闫昊
 * @date: 2018/7/21
 * @function: 待处理
 */
public class Todo {

    // TODO: 2018/7/21 EventBus？？？
    // TODO: 2018/7/21 图标库使用？？？
    // TODO: 2018/7/21 常用工具类集成：Utils *
    // TODO: 2018/7/25 沉浸式 *
    // TODO: 2018/7/25 数据库优化 *
    // TODO: 2018/7/25 6.0以下状态栏字体颜色设置（深色）
    // TODO: 2018/7/25 动态设置状态栏占位View的高度 *
    // TODO: 2018/7/26 App打分
    // TODO: 2018/7/26 Glide加载列表图片？Glide封装 *

    // TODO: 2018/7/31 搜索-选中某条历史记录-置顶
    // TODO: 2018/7/31 内容为空不添加不搜索

    // TODO: 2018/8/7 大图浏览来回缩放，APP卡死
    // TODO: 2018/8/9 文字超链接、内部跳转、全文、事件分发的处理
    // TODO: 2018/8/9 动态发布时间格式设置
    // TODO: 2018/8/11 动态列表头部，灰色View（不是点赞和收藏激发的情况）

    // TODO: 2018/8/13 Activity栈管理（设置：退出登录，全部退出）
    // TODO: 2018/8/14 android测试机型选择： 型号oppo、vivo、华为、小米；分辨率：1920*1080/1080*720、
    // TODO: 2018/8/14 动态主页和个人主页：收起动画完善
}
